<template>
<!-- 목록조회 가능 -->
<!-- + 누르면 페이지가 생성됩니다 -->
<!-- 토글 버튼을 눌러 하위 페이지를 열어보세요 -->
<!-- 삭제 버튼으로 삭제를 눌러주세요 -->
<!-- 상위 페이지 삭제시 하위 페이지는 한단계 위로 올라옵니다 -->
<!-- 수정을 하고 영역을 눌르면 반영됩니다 -->
<div>기능</div> 
<div>1. 워크스페이스 추가</div>
<div> : 최초 생성- WORKSPACE 위에 마우스 올려 나온 추가 버튼 클릭</div> 
<div> : 하위 페이지 추가는 부모될 워크스페이스 마우스 올려 나온 버튼으로</div>
<div> : 제목 내용 둘 중 하나만 있어도 워크스페이스 생성</div>
<div> : 제목 없으면 '제목 없음'으로 타이틀 지정</div>  
<div> : 깊이는 총 4까지만 </div>
<br>
<div>  2. 워크스페이스 삭제</div> 
<div> : 워크스페이스에 마우스 대면 나오는 점 세개 버튼 누르면 나오는 모달 창 눌러 삭제</div> 
<div> : 부모 삭제시 자식 스페이스 전부 한단계 위로 점프됨</div> 
<br> 
<div>3. 워크스페이스 수정</div>
<div>  : 워크스페이스 타이틀 클릭 후 제목과 내용을 수정하고 외부 영역 클릭</div> 
<div> : 외부 영역은 사이드바와 입력되는 부분을 제외한 외부영역</div>
<br>
<div>자식 스페이스가 하나도 없는 상태로 토글 열면 하위페이지 없다는 메시지나옴</div>
<br>
<div>현재 이 페이지는 워크스페이스가 0개일때 무조건 나오는 페이지</div>
<div>다시 이 페이지를 열려면 WORKSPACE 클릭</div>
</template>
<script>
export default {
  
}
</script>